# Pandas
`pip install pandas`
- Dataframe - Special Object to store data in tabular form (rows and columns)

In [2]:
import pandas as pd
import numpy as np

In [5]:
# Try to create a data frame
user_data = {
    "MarksA":np.random.randint(1,100,5),
    "MarksB":np.random.randint(50,100,5),
    "MarksC":np.random.randint(1,100,5)
}

In [4]:
np.random.randint(1,100,10)

array([14, 98, 11, 55, 66,  9, 26, 12, 41, 94])

In [6]:
user_data

{'MarksA': array([ 1, 69,  6, 71, 70]),
 'MarksB': array([56, 93, 88, 75, 50]),
 'MarksC': array([69, 14, 43, 16, 79])}

In [7]:
df = pd.DataFrame(user_data)

In [9]:
print(df)

   MarksA  MarksB  MarksC
0       1      56      69
1      69      93      14
2       6      88      43
3      71      75      16
4      70      50      79

In [10]:
df.head()

   MarksA  MarksB  MarksC
0       1      56      69
1      69      93      14
2       6      88      43
3      71      75      16
4      70      50      79

In [13]:
# to get all the headers
print(df.columns)

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [17]:
df.to_csv('marks.csv',index=False)

In [18]:
my_data = pd.read_csv('marks.csv')
my_data

   MarksA  MarksB  MarksC
0       1      56      69
1      69      93      14
2       6      88      43
3      71      75      16
4      70      50      79

In [ ]:
# to drop any columns we can use this method
my_data.drop()

In [19]:
my_data.describe()

          MarksA     MarksB     MarksC
count   5.000000   5.000000   5.000000
mean   43.400000  72.400000  44.200000
std    36.473278  19.007893  29.727092
min     1.000000  50.000000  14.000000
25%     6.000000  56.000000  16.000000
50%    69.000000  75.000000  43.000000
75%    70.000000  88.000000  69.000000
max    71.000000  93.000000  79.000000

In [21]:
my_data.tail(3)

   MarksA  MarksB  MarksC
2       6      88      43
3      71      75      16
4      70      50      79

In [22]:
# access 3rd row
my_data.iloc[3]

MarksA    71
MarksB    75
MarksC    16
Name: 3, dtype: int64

In [23]:
# 3rd row 1st column
my_data.iloc[3,1]

75

In [24]:
my_data.iloc[3][1]

75

In [29]:
idx = my_data.columns.get_loc('MarksA')
my_data.iloc[3,idx]

71

In [31]:
idx = [my_data.columns.get_loc('MarksA'),my_data.columns.get_loc('MarksB')]
print(idx)
my_data.iloc[3,idx]

[0, 1]

MarksA    71
MarksB    75
Name: 3, dtype: int64

In [32]:
idx = [my_data.columns.get_loc('MarksA'),my_data.columns.get_loc('MarksB')]
print(idx)
my_data.iloc[:3,idx]

[0, 1]

   MarksA  MarksB
0       1      56
1      69      93
2       6      88

In [34]:
# sort data frame
my_data.sort_values(by=["MarksA"],ascending=False)

   MarksA  MarksB  MarksC
3      71      75      16
4      70      50      79
1      69      93      14
2       6      88      43
0       1      56      69

In [36]:
# sort data frame
my_data.sort_values(by=["MarksC","MarksA"],ascending=True)

   MarksA  MarksB  MarksC
1      69      93      14
3      71      75      16
2       6      88      43
0       1      56      69
4      70      50      79

In [37]:
data_array = my_data.values

In [38]:
print(data_array)

[[ 1 56 69]
 [69 93 14]
 [ 6 88 43]
 [71 75 16]
 [70 50 79]]

In [39]:
print(type(data_array))

<class 'numpy.ndarray'>

In [40]:
data_array[2][2]

43

In [41]:
data_array

array([[ 1, 56, 69],
       [69, 93, 14],
       [ 6, 88, 43],
       [71, 75, 16],
       [70, 50, 79]])

In [ ]:
# Numpy arrays to data frame

In [42]:
new_df = pd.DataFrame(data_array,dtype='int32',columns=['Physics','Chem','Maths'])

In [43]:
new_df

   Physics  Chem  Maths
0        1    56     69
1       69    93     14
2        6    88     43
3       71    75     16
4       70    50     79

In [45]:
new_df.to_csv('pcm.csv',index=False)

In [ ]:
new_df= new_df.drop()